Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh3808-v3.tmx
Source language: bo
Languages: en

source: འདི་ལྟར་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་མ་བྱས། མ་བཤིག་མངོན་པར་འདུས་མ་བྱས་པ་ཡིན་ཏེ། དེ་བས་ན་དེའི་དོན་དུ་གོ་ཆ་ཆེན་པོ་བགོས་པར་མི་རིགས་སོ།
en: But the knowledge of all aspects is not made, is not unmade, and does not occasion anything, so it is not correct to become armed with great armor for that purpose.

source: །དེ་བས་ན་གོ་ཆ་མེད་པའི་གོ་ཆ་བགོས་སོ་ཞེས་བྱ་བར་རིགས་སོ་སྙམ་དུ་དགོངས་པའོ།
en: The intention, therefore, is that they are correct to think they are “armed with no armor.”

source: །དེ་ཉིད་ཀྱི་ཕྱིར་བྱེད་པ་པོ་མི་དམིགས་པས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་མ་བྱས། མ་བཤིག་མངོན་པར་འདུས་མ་བྱས་པ་སྟེ། འདི་ལྟར་དེ་དག་ཤིན་ཏུ་མེད་ཅིང་། མི་དམིགས་པའི་ཕྱིར་རོ་ཞེས་བྱ་བ་གསུངས་སོ།
en: Just because of that it says, “Subhūti, given that you cannot apprehend a maker, the knowledge of all aspects is not made, not unmade, and does not occasion anything … Because they absolutely do not exist and absolutely cannot be apprehended.”

source: །དེ་བཞིན་ཉིད་ཀྱང་གང་གི་ཚེ་གཟུགས་ཀྱི་དེ་བཞིན་ཉིད་དང་སྒྲའི་དེ་བཞིན་ཉིད་ཅེས་བྱ་བ་ལ་སོགས་པ་ཀུན་བརྟགས་པའི་རྣམ་པར་མི་འཛིན་པ་དེའི་ཚེ་ཡང་དེའི་རྣམ་པར་ཡོད་པ་མ་ཡིན་པས་དེ་སྐད་ཅེས་བྱའོ།
en: Also, it says that about “suchness,” because when it is grasped in a falsely imagined form, as “the suchness of form, the suchness of feeling” and so on, in that form it does not exist.

source: །དེ་ནས་ཡང་གནས་བརྟན་གྱིས་བདག་གི་བསམ་པ་བརྟན་པའི་ཕྱིར། བཅོམ་ལྡན་འདས་བདག་གིས་བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པའི་དོན་འཚལ་བ་ལྟར་ན་ཞེས་བྱ་བ་གསོལ་ཏོ།
en: Then the elder Subhūti, in order to teach what he is thinking, says, “Lord, the way I understand what you have said, Lord,” and so on.

source: །གཟུགས་ནི་མ་བཅིངས་མ་གྲོལ་བའོ་ཞེས་བྱ་བ་ཅི་ལས་དགོངས་ཤེ་ན་འགའ་ཞིག་འདི་སྙམ་དུ་འདི་ལྟར་ཟག་པ་དང་བཅས་པའི་ཕུང་པོ་ལྔ་པོ་དག་ནི་ཀུན་ཏུ་སྦྱོར་བ་ལ་སོགས་པས་བཅིངས་ཏེ། དེ་དག་ཀྱང་བཅིངས་པར་གྱུར་ནས། ལས་དང་ཉོན་མོངས་པ་དག་གིས་ཡང་དང་ཡང་འཁོར་བར་བྱེད་ལ། ཟག་པ་མེད་པ་དག་ནི་ཕྱིས་གྲོལ་བར་འགྱུར་ཏེ།
en: What is intended where it says “form is not bound and is not freed”? Some think that because the five aggregates without outflows are bound with fetters, and so on, they are bound by afflictions and karma, going in cycles from one form of life to another again and again, and later the ones without outflows are freed, at which point they are destroyed.

source: དེའི་ཚེ་བཤིག་པར་གྱུར་ན་མ་བྱས་མ་བཤིག་ཅེས་བྱ་བ་སྙམ་དུ་སེམས་པ་དེའི་ཕྱིར་གཟུགས་ནི་མ་བཅིངས་མ་གྲོལ་ཞེས་བྱ་བ་ལ་སོགས་པ་སྨོས་ཏེ།
en: But because of what was intended by “not made” and “not unmade” it says they are “not bound and are not freed” and so on.

source: བཅིངས་པ་དང་གྲོལ་བ་གཉིས་ནི་ཡོད་པ་ལས་འགྱུར་ན།
en: This means both being bound and being freed happen when something exists.

source: འདི་ལྟར་གཟུགས་ལ་སོགས་པ་ནི་ཤིན་ཏུ་མེད་པ་ཡིན་པས་ཡོད་པ་མ་ཡིན་པ་དེ་དག་ལ་བཅིངས་པ་དང་གྲོལ་བ་ག་ལ་ཡོད་དེ་མི་འགྲུབ་བོ།
en: Thus, form and so on are totally nonexistent things so how could being bound and being freed happen to them, given that they do not exist? They are not established.

source: །ཀུན་བརྟགས་པའི་དབང་གིས་ནི་བཅིངས་པ་དང་གྲོལ་བ་གཉིས་བསྟན་གྱི། དོན་དམ་པར་ནི་མ་ཡིན་ནོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: Being bound and being freed are taught based on the falsely imagined, but not ultimately.

source: །དེ་བས་ན་ཚེ་དང་ལྡན་པ་གང་པོ་གཟུགས་ཉིད་མེད་པའི་ཕྱིར། གཟུགས་དེ་མ་བཅིངས་མ་གྲོལ་བའོ་ཞེས་བྱ་བ་ལ་སོགས་པ་བཤད་དོ།
en: Therefore, it says, “Venerable Pūrṇa, because form does not exist, form is not bound and is not freed,” and so on.

source: །རྨི་ལམ་ལྟ་བུ་ཞེས་བྱ་བ་ལ་སོགས་པས་ནི་ཡོངས་སུ་གྲུབ་པའི་གཟུགས་ཀྱང་མ་བཅིངས་མ་གྲོལ་བ་ཉིད་དུ་བསྟན་ཏོ། །དབེན་པ་དང་། ཞི་བ་དང་།
en: With they are “dream-like” and so on, it teaches that thoroughly established form is also not bound and is not freed. “

source: སྟོང་པའི་ཕྱིར་ཞེས་བྱ་བ་ནི་ནམ་མཁའ་བཞིན་དུ་གནས་པ་ལ་བཅིངས་པ་དང་། གྲོལ་བ་ཉིད་མི་རིགས་སོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: Because [they are] isolated, calm, empty” means they abide, like space, so it is not logical that they are bound and freed.

source: །ལྷག་མ་རྣམས་ནི་གོ་སླའོ།
en: The rest is easy to understand. 6.

source: །དེ་ལྟར་གོ་ཆ་ཆེན་པོ་བརྟན་པ་ཡོངས་སུ་རྫོགས་པར་བྱས་ནས།
en: How is it a great vehicle?

source: གནས་བརྟན་རབ་འབྱོར་གྱིས་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པ་ཞེས་བྱ་བའི་ཚིག་བཟུང་སྟེ། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཐེག་པ་ཆེན་པོ་གང་ལགས་ཞེས་བྱ་བ་ལ་སོགས་པ་ཞུ་བ་རྣམ་པ་ལྔ་བརྩམས་སོ། །དེ་ལ་བཅོམ་ལྡན་འདས་ཀྱིས་ཐེག་པ་ཆེན་པོ་ཞེས་བྱ་བ་རྣམ་པ་ཉི་ཤུ་རྩ་གཅིག་ཏུ་ཕྱེ་སྟེ། བཤད་པ་འདི་ལྟ་སྟེ། ཕ་རོལ་ཏུ་ཕྱིན་པའི་ཐེག་པ་ཆེན་པོ་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་ཀྱི་ཐེག་པ་ཆེན་པོ་དང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཀྱི་ཐེག་པ་ཆེན་པོ་དང་།
en: Having made the great armor stable and complete, the elder Subhūti, taking as his point of departure the statement “have set out in a great vehicle,” has posed five questions: “Lord, what is the Great Vehicle of bodhisattva great beings?”

source: དྲན་པ་ཉེ་བར་གཞག་པའི་ཐེག་པ་ཆེན་པོ་དང་། ཡང་དག་པར་སྤོང་བའི་ཐེག་པ་ཆེན་པོ་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པའི་ཐེག་པ་ཆེན་པོ་དང་། དབང་པོའི་ཐེག་པ་ཆེན་པོ་དང་།
en: and so on.

source: སྟོབས་ཀྱི་ཐེག་པ་ཆེན་པོ་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་གི་ཐེག་པ་ཆེན་པོ་དང་།
en: There the Lord explains “Great Vehicle” under twenty-one subdivisions.

source: ལམ་གྱི་ཐེག་པ་ཆེན་པོ་དང་། རྣམ་པར་ཐར་པའི་ཐེག་པ་ཆེན་པོ་དང་། ཤེས་པའི་ཐེག་པ་ཆེན་པོ་དང་། དབང་པོའི་ཐེག་པ་ཆེན་པོ་དང་། ཏིང་ངེ་འཛིན་གསུམ་གྱི་ཐེག་པ་ཆེན་པོ་དང་། རྗེས་སུ་དྲན་པའི་ཐེག་པ་ཆེན་པོ་དང་། སྙོམས་པར་འཇུག་པ་ལྔའི་ཐེག་པ་ཆེན་པོ་དང་།
en: These are: Great Vehicle of the perfections,Great Vehicle of all the emptinesses,Great Vehicle of all the meditative stabilizations,Great Vehicle of the applications of mindfulness, Great Vehicle of the right efforts,Great Vehicle of the legs of miraculous power, Great Vehicle of the faculties,Great Vehicle of the powers,Great Vehicle of the limbs of awakening, Great Vehicle of the path, Great Vehicle of the liberations, Great Vehicle of the knowledges, Great Vehicle of the three faculties, Great Vehicle of the three meditative stabilizations, Great Vehicle of the mindfulnesses, Great Vehicle of the five absorptions, Great Vehicle of the ten powers, Great Vehicle of the four fearlessnesses, Great Vehicle of the four detailed and thorough knowledges, Great Vehicle of the eighteen distinct attributes of a buddha, andGreat Vehicle of the dhāraṇī gateways.

source: མི་འཇིགས་པའི་ཐེག་པ་ཆེན་པོ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པའི་ཐེག་པ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པའི་ཐེག་པ་ཆེན་པོ་དང་། གཟུངས་ཀྱི་སྒོའི་ཐེག་པ་ཆེན་པོའོ། །དེ་ལ་གཉིས་པ་སྟོང་པ་ཉིད་ཀྱི་ཐེག་པ་ཆེན་པོའི་འགྲེས་ལ་མིག་ནི་མིག་གིས་སྟོང་སྟེ།
en: Great Vehicle of all the emptinesses Among these, in the second section of the text, Great Vehicle of all the emptinesses, it says “eyes are empty of eyes because they are neither unmoved nor destroyed.”

source: ཐེར་ཟུག་ཏུ་གནས་པ་མེད་པ་དང་། འཇིག་པ་མེད་པའི་ཕྱིར་ཞེས་བྱ་བ་ནི་ཀུན་བརྟགས་པའི་མིག་ནི་ཀུན་བརྟགས་པའི་མིག་གིས་སྟོང་སྟེ།
en: Falsely imagined eyes are empty of falsely imagined eyes. “

source: སྟོང་པ་ནི་མེད་པའི་དོན་ཡིན་པས་མིག་ལ་མིག་གི་དངོས་པོ་མེད་དོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: Empty” has the sense of nonexistent so it means a real basis of eyes does not exist in the eyes.

source: །གལ་ཏེ་ཡོད་པ་ཞིག་ཡིན་ན་རྟག་པ་ཐེར་ཟུག་ཏུ་གནས་པ་ཞིག་གམ། མི་རྟག་པ་འཇིག་པ་ཞིག་ཡིན་གྲང་ན།
en: This means were they to be existent you can suppose they would remain there permanently unmoved, or they would be impermanent and destroyed.

source: འདི་ལྟར་ཐེར་ཟུག་ཏུ་གནས་པ་མ་ཡིན་ཞིང་འཇིག་པ་མེད་དེ།
en: Thus they do not remain there unmoved and they are not destroyed, so they do not exist because “they are neither unmoved nor destroyed.” “

source: དེའི་ཕྱིར་ཐེར་ཟུག་ཏུ་གནས་པ་མ་ཡིན་ལ་འཇིག་པ་མེད་པས་མེད་དོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ། །དེའི་རང་བཞིན་དེ་ཡིན་པའི་ཕྱིར་རོ་ཞེས་བྱ་བ་ནི་མིག་ལ་མིག་གི་དངོས་པོ་མེད་པ་ཉིད་དེའི་རང་བཞིན་ཏེ། ངོ་བོ་ཉིད་ཅེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: Because that is their basic nature”— the absence of a real basis of eyes in the eyes is their basic nature, which is to say, their intrinsic nature.

source: །ནང་དང་ཕྱིའི་ཆོས་རྣམས་སོ་སོར་མེད་པ་ཉིད་དེ་སྟོང་པ་ཉིད་གཉིས་སོ།
en: The nonexistence of inner and outer dharmas, each separately, are two emptinesses.

source: །ནང་གི་ཆོས་རྣམས་ཕྱིའི་ཆོས་རྣམས་ལ་འཛིན་པ་དང་། ཕྱིའི་ཆོས་རྣམས་ནང་གི་ཆོས་རྣམས་ཀྱི་ཡུལ་དུ་གྱུར་པ་སྟེ། ཡུལ་ཅན་དང་ཡུལ་གྱི་དངོས་པོ་སྟོང་པ་ཉིད་གང་ཡིན་པ་དེ་ནི་ཕྱི་ནང་སྟོང་པ་ཉིད་དེ་གསུམ་པའོ།
en: The emptiness of inner dharmas that grasp outer dharmas, and of outer dharmas that have become objects of inner dharmas, that is, of subjects and objects is the “emptiness of inner and outer,” the third emptiness.

source: །ཆོས་ཐམས་ཅད་སྟོང་པ་ཉིད་གང་ཡིན་པའི་སྟོང་པ་ཉིད་དེས་སྟོང་པ་ཉིད་དུ་གྱུར་པ་འདི་ནི་སྟོང་པ་ཉིད་སྟོང་པ་ཉིད་ཅེས་བྱ་སྟེ།
en: That which has become “the emptiness of that emptiness that is the emptiness of all dharmas is the emptiness of emptiness.”

source: སྟོང་པ་ཡང་དེ་ཡིན་ལ་སྟོང་པ་ཉིད་ཀྱང་དེ་ཡིན་པའི་ཕྱིར་སྟོང་པ་ཉིད་སྟོང་པ་ཉིད་ཅེས་བྱའོ།
en: It is called an “emptiness of emptiness” because it is that—empty—and it is that—emptiness—as well. So, it is called an “emptiness of emptiness.”

source: །གང་གིས་སྟོང་ཞེ་ན།
en: Of what is it empty?

source: ཆོས་ཐམས་ཅད་ཀྱི་སྟོང་པ་ཉིད་གང་ཡིན་པ་སྟེ། སྟོང་པ་ཉིད་དེས་སྟོང་ངོ་ཞེས་བཤད་དོ།
en: It is saying it is empty of the emptiness that is the emptiness of all dharmas.

source: །ཇི་སྐད་བསྟན་པར་འགྱུར་ཞེ་ན།
en: What is it teaching?

source: སྟོང་པ་ཉིད་ལ་སྟོང་པ་ཉིད་གཉིས་པ་གཞན་ནི་ཡོད་པ་མ་ཡིན་གྱི་ངོ་བོ་ཉིད་ཁོ་ནས་སྟོང་ངོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: It means there is no other second emptiness in emptiness; it is “empty” just from its nature. “

source: །ཤར་ཕྱོགས་ནི་ཤར་ཕྱོགས་ཀྱིས་སྟོང་ཞེས་བྱ་བའི་ཆོས་ཆེན་པོ་རྣམས་ཀྱི་སྟོང་པ་ཉིད་ནི་ཆེ་བ་ཉིད་ཡིན་པས་ཆེན་པོ་སྟོང་པ་ཉིད་ཅེས་བྱ་སྟེ། ཕྱོགས་ཐམས་ཅད་དུ་ཁྱབ་པ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ། །ཐེར་ཟུག་ཏུ་གནས་པ་མེད་པ་དང་།
en: The eastern direction is empty of the eastern direction”; it is called a “great emptiness,” in the sense that “it pervades all directions” because the emptiness of things that are huge is greater. “

source: འཇིག་པ་མེད་པའི་ཕྱིར་མྱ་ངན་ལས་འདས་པ་དེ་འང་མྱ་ངན་ལས་འདས་པས་སྟོང་ངོ་ཞེས་བྱ་བ་ནི་དོན་དམ་པའི་མྱ་ངན་ལས་འདས་པའི་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་ངོ་།
en: Nirvāṇa is also empty of nirvāṇa because it is neither unmoved nor destroyed.” It is empty of the basic nature of ultimate nirvāṇa.

source: །མྱ་ངན་ལས་འདས་པ་ཐེར་ཟུག་ཏུ་གནས་པ་ཞེས་མི་བྱའམ་ཞེ་ན།
en: But is nirvāṇa not taken to be “unmoved”?

source: ཉན་ཐོས་ཀྱི་ཐེག་པ་པ་རྟོགས་པ་དང་བཅས་པ་ཁ་ཅིག་གི་ཚུལ་ནི་དེ་ལྟ་མ་ཡིན་གྱི། དོན་དམ་པར་ནི་མྱ་ངན་ལས་འདས་པ་ཞེས་བྱ་བའི་ཆོས་གང་ཡང་མེད་དོ།
en: The system of some thinkers in the Śrāvaka Vehicle is like that, but in “ultimate reality” there is no dharma called “nirvāṇa.” “

source: །འདུས་བྱས་ཞེས་བྱ་བ་ནི་ཁམས་གསུམ་པའོ་ཞེས་བྱ་བ་ལ་འདུས་བྱས་ཐམས་ཅད་ཁམས་གསུམ་དུ་གཏོགས་པའི་ཕྱིར་དེ་སྐད་ཅེས་བྱའོ། །གང་ལ་སྐྱེ་བ་མེད་པ་དང་། འགག་པ་མེད་པ་དང་། འཇིག་པ་མེད་པ་དང་།
en: The compounded” is the three realms.

source: གནས་པ་མེད་པ་དང་།
en: It says this because all compounded things are included in the three realms. “

source: གཞན་དུ་འགྱུར་བ་མེད་པ་ཞེས་བྱ་བ་ལ་ཆོས་རྣམས་འབྱུང་བ་ནི་སྐྱེ་བའོ། །རྒྱུན་ཆད་པ་ནི་འགག་པའོ། །སྐད་ཅིག་གཅིག་ལ་འཇིག་པ་ནི་ཞིག་པའོ། །རྒྱུན་གྱི་རྒྱུད་མ་ཆད་པ་ནི་གནས་པའོ། །རྒྱུན་རྣམས་ཀྱི་སྔ་ཕྱིའི་བྱེ་བྲག་ནི་གཞན་དུ་གྱུར་པ་ཞེས་བྱའོ།
en: What has no production, no stopping, no destruction, no lasting, and no changing into something else”— the arising of dharmas is “production,” cutting the stream is “stopping,” moment by moment perishing is “destruction,” not cutting the stream of a continuum is “lasting,” and the earlier and later distinction in a continuum is “changing into something else.”

source: །གང་ལ་ཆོས་དེ་དག་མེད་པའི་ཆོས་དེ་དག་ལ་འདུས་མ་བྱས་པ་ཞེས་བྱའོ། །ནམ་མཁའ་དང་། དེ་བཞིན་ཉིད་དང་། འགོག་པ་གཉིས་དང་།
en: The dharmas in which these are absent are the “uncompounded,” which is to say space, suchness, and the two cessations.

source: ཆོས་དེ་དག་འདུས་མ་བྱས་པའི་དངོས་པོར་ཡོད་པ་མ་ཡིན་པའི་ཕྱིར། འདུས་མ་བྱས་སྟོང་པ་ཉིད་ཅེས་བྱའོ།
en: Those phenomena that are uncompounded do not exist as real bases, hence “the emptiness of the uncompounded.”

source: །ཆད་པའི་མཐའ་དང་། རྟག་པའི་མཐའོ་ཞེས་བསྟན་པ་ཙམ་དུ་ཟད་པས་དངོས་པོ་དང་། དངོས་པོ་མེད་པ་དང་། ཆོས་དང་ཆོས་མ་ཡིན་པ་དང་། ཡོད་པ་དང་མེད་པ་ལ་སོགས་པའི་མཐའ་རྣམས་ཀྱང་འདི་ཉིད་དུ་འདུས་སོ།
en: Since it is enough just to teach “it is the extreme of annihilation and it is the extreme of permanence,” the extremes of an existent thing and a nonexistent thing, dharma and nondharma, existence and nonexistence, and so on are included in just that.

source: །གང་ལ་ཐོག་མ་དང་ཐ་མ་མི་དམིགས་པ་དེ་ལ་དབུས་མེད་ཅེས་བྱ་བ་ནི་ཐོག་མ་དང་ཐ་མ་མེད་པ་ཞེས་བྱ་བ་ལ་སོགས་པ་ཐོག་མ་ཞེས་བྱ་བ་ནི་སྔོན་གྱི་མཐའ་ལ་བྱའོ། །ཐ་མ་ཞེས་བྱ་བ་ནི་ཕྱི་མའི་མཐའ་ལ་བྱའོ། །ཡང་ན་ཐ་མ་ཞེས་བྱ་བ་ནི་དང་པོའི་མཐའ་ལ་བྱའོ། །ཐོག་མ་ཞེས་བྱ་བ་ནི་ཕྱི་མའི་མཐའ་ལ་བྱ་སྟེ།
en: As for “that of which a beginning and an end are not found has no middle,” and so on—in “no beginning and end,” take “a beginning” as the past and take “an end” as the future; alternatively, take “a beginning” as former and “an end” as later.

source: མཐའ་དེ་གཉིས་མེད་པའི་ཕྱིར་དབུས་ཀྱང་མེད་པར་འགྱུར་ཏེ།
en: Because both extremes do not exist, a “middle” does not exist either.

source: དེ་བས་ན་ཐོག་མ་མེད་པ་དང་། ཐ་མ་མེད་པ་དང་། དབུས་མེད་པའི་སྟོང་པ་ཉིད་ལ། ཐོག་མ་དང་ཐ་མ་མེད་པ་སྟོང་པ་ཉིད་ཅེས་བྱའོ།
en: Hence the emptiness of no beginning, no end, and no middle is “the emptiness of no beginning and no end.”

source: །ཡང་ན་ཐོག་མ་དང་ཐ་མ་དང་། དབུས་མེད་པ་དེ་དག་ཉིད་ཐོག་མ་དང་ཐ་མ་དང་དབུས་མེད་པས་སྟོང་པའི་ཕྱིར་ཐོག་མ་དང་ཐ་མ་མེད་པ་སྟོང་པ་ཉིད་ཅེས་པའོ།
en: Alternatively, just no beginning, no end, and no middle are empty of a beginning, end, and middle, hence “the emptiness of no beginning and no end.” “

source: །དོར་བ་མེད་པ་སྟོང་པ་ཉིད་ཅེས་བྱ་བ་ནི་ཇི་ལྟར་སྔར་བླངས་པའི་ཆུ་བོ་ཞིང་མེད་པར་བྱས་ན་བུམ་པ་སྟོང་པར་འགྱུར་བ་དེ་བཞིན་དུ། དོན་དམ་པའི་རྫས་སྔོན་བྱུང་བ་རྣམས་ཕྱིས་བོར་ཞིང་བཏང་བ་འདི་ལ་སྟོང་པ་ཉིད་རྣམ་པར་གཞག་པ་ནི་ཡིན་གྱི།
en: The emptiness of nonrepudiation”— this means emptiness is not posited like a pitcher becoming empty when you tip out and get rid of the water it had before— that you later reject and throw away some ultimately real material that was there before.

source: ཆོས་རྣམས་ངོ་བོ་ཉིད་ཀྱིས་མེད་པ་དེ་སྟོང་པ་ཉིད་ཅེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: The nonexistence of dharmas in their intrinsic nature is “emptiness.”

source: །དེ་ལ་དོར་བ་མེད་པ་ནི་དོར་བ་མེད་པས་སྟོང་ངོ་ཞེས་བྱ་བ་ནི་དོར་བ་མེད་པའི་ཆོས་ནི་གང་ཡང་མེད་དོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: There, “nonrepudiation is empty of nonrepudiation” means an attribute, nonrepudiation, does not exist at all. “

source: །རང་བཞིན་སྟོང་པ་ཉིད་ཅེས་བྱ་བ་ནི་འདུས་བྱས་དང་། འདུས་མ་བྱས་རྣམས་ཀྱི་རང་བཞིན་ཆོས་ཉིད་སྟོང་པ་ཉིད་གང་ཡིན་པ་དེ་ནི་ཉན་ཐོས་སམ། རང་སངས་རྒྱས་སམ། དེ་བཞིན་གཤེགས་པའམ། གང་གིས་ཀྱང་མ་བྱས་མ་མཛད་དེ།
en: The emptiness of a basic nature”— that true nature of dharmas, which is emptiness, “the basic nature of… the compounded or uncompounded,” is not fabricated by anyone, “is not made by śrāvakas… pratyekabuddhas… or tathāgatas,” hence it is called “basic nature.”

source: དེ་བས་ན་རང་བཞིན་ཞེས་བྱ་བའོ། །ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་དེ་ཡང་རང་བཞིན་གྱིས་སྟོང་སྟེ། ཆོས་ཅན་ཡོད་ན་ནི་དེའི་རང་བཞིན་ཡང་འགྲུབ་པར་འགྱུར་བ་ཞིག་ན། འདི་ལྟར་ཆོས་ཅན་ཉིད་མེད་ན་དེ་གང་གི་རང་བཞིན་དུ་བརྗོད་པར་འོས་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: That basic nature of all attributes is also empty of a basic nature, in the sense that when that which possesses an attribute exists its basic nature is established; and if just such a possessor of an attribute does not exist, of what would it be suitable to say it is its basic nature?

source: །དེ་བས་ན་རང་བཞིན་ནི་རང་བཞིན་གྱིས་སྟོང་ངོ་ཞེས་བྱ་བ་གསུངས་སོ།
en: Therefore, it says “a basic nature is empty of a basic nature.” “

source: །ཆོས་ཐམས་ཅད་ནི་ཆོས་ཐམས་ཅད་ཀྱིས་སྟོང་ངོ་ཞེས་བྱ་བ་ནི་དོན་དམ་པར་ན་ཆོས་ཐམས་ཅད་ལ་ཆོས་ཐམས་ཅད་ཀྱི་ངོ་བོ་ཉིད་མེད་དོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: All dharmas are empty of all dharmas” means ultimately all dharmas do not have the intrinsic nature of all dharmas. “

source: །རང་གི་མཚན་ཉིད་སྟོང་པ་ཉིད་ཅེས་བྱ་བ་ནི་ཆོས་རྣམས་མེད་ན་འདི་དག་གང་གིས་རང་གི་མཚན་ཉིད་དུ་འགྱུར།
en: The emptiness of its own mark”— this means that if dharmas are nonexistent, of what would those be the specific marks?

source: དེ་བས་ན་ཆོས་རྣམས་ཀུན་བརྟགས་པ་ཙམ་དུ་ཟད་པའི་ཕྱིར་མཚན་ཉིད་འདི་དག་ཀྱང་ཀུན་བརྟགས་པ་ཡིན་པས་མེད་དོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: Therefore, because dharmas are simply just falsely imagined, these marks also are falsely imagined and hence do not exist. “

source: །མི་དམིགས་པ་སྟོང་པ་ཉིད་ཅེས་བྱ་བ་ནི་དུས་གསུམ་དུ་རྟོགས་པའི་ཆོས་རྣམས་དུས་གསུམ་གྱི་བདག་ཉིད་དུ་མེད་པ་གང་ཡིན་པ་དེ་མི་དམིགས་པ་སྟེ།
en: The emptiness of not apprehending”— those “dharmas” included in the three times that do not exist in the three times “cannot be apprehended.”

source: མི་དམིགས་པ་དེ་ཡང་མི་དམིགས་པའི་བདག་ཉིད་ཀྱིས་སྟོང་གི། མི་དམིགས་པ་ཞེས་བྱ་བའི་ཆོས་གཞན་དུ་གྱུར་པ་ནི་གང་ལ་ཡང་མེད་དོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: That “not apprehending is empty of not apprehending” in the sense that some other attribute—“not apprehending”—does not exist anywhere at all. “

source: །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཅེས་བྱ་བ་ནི་རྣམ་པ་གཉིས་སུ་བཤད་དེ།
en: The emptiness of the nonexistence of an intrinsic nature”— this has two explanations.

source: དེ་ལ་བཤད་པ་སྔ་མ་ནི། རབ་འབྱོར་འདུས་པ་ལས་བྱུང་བའི་ཆོས་ཀྱི་ངོ་བོ་ཉིད་མེད་ཅེས་བྱ་བ་སྟེ།
en: There the first explanation is, “Subhūti, the intrinsic nature of a phenomenon that has arisen from a union does not exist.”

source: འདི་ལ་ཆོས་ཐམས་ཅད་སྐྱེ་བ་ན། རང་གི་སྟོབས་འབའ་ཞིག་གིས་སྐྱེ་བ་ནི་མ་ཡིན་གྱི། རྒྱུ་དང་རྐྱེན་གྱི་སྟོབས་ཀྱིས་སྐྱེ་སྟེ།
en: Here, when all phenomena are produced, they are not produced solely through their own power; they are produced through the power of causes and conditions.

source: དཔེར་ན་ས་བོན་གྱིས་མྱུ་གུ་སྐྱེད་པ་ན་རང་གི་མཐུ་འབའ་ཞིག་གིས་སྐྱེད་པ་ནི་མ་ཡིན་གྱི། ས་དང་ཆུ་ལ་སོགས་པ་འདུས་པའི་མཐུས་བསྐྱེད་པ་དེ་བཞིན་དུ་ཆོས་ཐམས་ཅད་ཀྱང་རྒྱུ་དང་། རྐྱེན་ཚོགས་པའི་མཐུས་སྐྱེའོ།
en: To illustrate, when a seed produces a seedling, it does not produce it solely through its own force; it is produced through the force of a union with soil, water, and so on. Similarly, all phenomena are produced from a complex of causes and conditions.

source: །རང་གི་མཐུ་འབའ་ཞིག་གིས་སྐྱེ་བ་མ་ཡིན་པའི་ཕྱིར་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་ཁོ་ནའོ།
en: They are not produced solely thought their own force, so they are just dependent originations.

source: །ཆོས་གཞན་ལ་བརྟེན་ཏེ་སྐྱེ་བའི་ཆོས་གང་ཡིན་པ་དེ་དག་ནི་གཟུགས་སུ་རུང་བ་དང་། མྱོང་བ་ལ་སོགས་པའི་རང་བཞིན་ཡིན་དུ་ཟིན་ཀྱང་། རྒྱུ་དང་རྐྱེན་ཚོགས་པ་ཉིད་ལས་སྐྱེ་བར་འགྱུར་བས་ན་འདུས་པ་ལས་བྱུང་བ་ཞེས་བྱའོ།
en: Even though those phenomena produced in dependence on other phenomena have the nature of being seeable, an experience, and so on, still, insofar as they are produced just from the complex of causes and conditions, it is said they have “arisen from a union.”

source: །འདུས་པ་ལས་བྱུང་བ་གང་ཡིན་པ་དེ་རང་གི་ངོ་བོ་ཉིད་ཅེས་བརྗོད་པར་ཇི་ལྟར་ནུས།
en: And how can you say of something that has arisen from a union that it is its “intrinsic nature”?

source: དེ་བས་ན་ཆོས་ཐམས་ཅད་གཞན་གྱི་དངོས་པོས་སྐྱེ་བའི་ཕྱིར་རང་གི་དངོས་པོ་མེད་པས་ངོ་བོ་ཉིད་མེད་པ་ཉིད་དོ། །རང་གི་དངོས་པོ་མེད་པ་ཉིད་ཀྱི་ཕྱིར་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་ཅེས་བྱའོ།
en: Therefore, all phenomena arise because of some other existent thing, an existence of its own does not exist, so, because their intrinsic nature does not exist, therefore it says “nonexistence of an intrinsic nature.”

source: །དེ་བས་ན་རབ་འབྱོར་འདུས་པ་ལས་བྱུང་བའི་ཆོས་ཀྱི་ངོ་བོ་ཉིད་མེད་དེ། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བའི་ཕྱིར་ཞེས་བྱ་བ་གསུངས་སོ།
en: And so it says, “Subhūti, the intrinsic nature of a phenomenon that has arisen from a union does not exist, because phenomena have originated dependently.”

source: །འདི་ཉིད་ཆོས་ཐམས་ཅད་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་དེ། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཅེས་བྱའོ། །བཤད་པ་ཅིག་ཤོས་ནི། དངོས་པོ་ནི་དངོས་པོས་སྟོང་ངོ་།
en: Just this is the intrinsic nature of all phenomena that are nonexistent things, “the emptiness that is the nonexistence of an intrinsic nature.”

source: །དངོས་པོ་མེད་པ་ནི་དངོས་པོ་མེད་པས་སྟོང་ངོ་ཞེས་བྱ་བ་སྟེ། དངོས་པོ་དང་ངོ་བོ་ཉིད་ནི་དངོས་པོ་དང་ངོ་བོ་ཉིད་དོ། །དངོས་པོ་དང་། ངོ་བོ་ཉིད་མེད་པ་ནི་དངོས་པོ་དང་།
en: In regard to the other explanation of “nonexistence of an intrinsic nature,” it says “an existent thing is empty of an existent thing, a nonexistent thing is empty of a nonexistent thing”— the existent thing and an intrinsic nature are an existent thing and an intrinsic nature; and the nonexistent thing and an intrinsic nature are a nonexistent thing and an intrinsic nature.

source: ངོ་བོ་ཉིད་མེད་པ་སྟེ། རྣམ་པར་རྟོག་པ་འདི་ལ་དངོས་པོ་མེད་པ་ཞེས་བྱ་བའི་སྒྲས་ནི་དངོས་པོ་ཡོད་པ་མ་ཡིན་པར་རྟོགས་པས་དངོས་པོ་དང་། དངོས་པོ་མེད་པ་ཡང་བཟུང་བ་ཡིན་ནོ། །ངོ་བོ་ཉིད་མེད་དོ་ཞེས་བྱ་བའི་སྒྲས་ནི་རང་གི་དངོས་པོ་མ་ཡིན་པར་རྟོགས་པས་གཞན་གྱི་དངོས་པོ་དང་། རང་གི་དངོས་པོ་ཡང་བཟུང་བ་ཡིན་ཏེ།
en: In this construction, from the words nonexistent thing it is realized that an existent thing does not exist whereby an existent thing, as well as a nonexistent thing, are grasped; and from the words nonintrinsic nature it is realized that it is not an intrinsic nature whereby an intrinsic nature, as well as a nature from something else, are grasped.

source: སྟོང་པ་བཞི་པོ་དེ་དག་ལ་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཅེས་བྱའོ། །དེ་ལས་བྱུང་བས་ན། དངོས་པོ་ཞེས་བྱ་སྟེ།
en: Those four emptinesses are called “the emptiness of the nonexistence of an intrinsic nature.” “

source: དངོས་པོ་ཞེས་བྱ་བའི་སྒྲ་ནི་འདུས་བྱས་ཀྱི་ཆོས་རྣམས་ལ་བྱའོ།
en: An existent thing” arises from those conditions, so associate the words “existent thing” with compounded phenomena.

source: །དེའི་ཕྱིར་དངོས་པོ་ནི་དངོས་པོས་སྟོང་ངོ་ཞེས་གསུངས་སོ།
en: Therefore, it says “an existent thing is empty of an existent thing.”

source: །དངོས་པོ་མེད་པའི་སྒྲས་ནི་འདུས་མ་བྱས་ཀྱི་ཆོས་རྣམས་ལ་བྱ་སྟེ།
en: Associate the words “nonexistent thing” with uncompounded phenomena.

source: དེའི་ཕྱིར་དངོས་པོ་མེད་པ་ནི་དངོས་པོ་མེད་པས་སྟོང་ངོ་ཞེས་གསུངས་སོ།
en: Therefore, it says “a nonexistent thing is empty of a nonexistent thing.”

source: །དེ་ལ་དངོས་པོའི་ཆོས་ནི་དངོས་པོའི་བདག་ཉིད་དང་བྲལ་བ་དང་། དངོས་པོ་མེད་པའི་ཆོས་ཀྱང་དངོས་པོ་མེད་པའི་བདག་ཉིད་དང་བྲལ་བ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: There it means an existent phenomenon is separated from an essential nature of an existent thing, and a nonexistent phenomenon is separated from an essential nature of a nonexistent thing. “

source: །ངོ་བོ་ཉིད་ཅེས་བྱ་བ་ནི་ཤེས་པ་དང་མཐོང་བ་སྟེ། ཆོས་རྣམས་ཀྱི་ཀུན་བརྟགས་པའི་གནས་སྐབས་ཡོངས་སུ་སྤངས་པའི་ལྷག་མ་ཡོངས་སུ་གྲུབ་པའི་གནས་སྐབས་ནི་ཤེས་པ་དང་མཐོང་བའི་ངོ་བོ་ཉིད་ཡིན་པའི་ཕྱིར་དེ་སྐད་ཅེས་བྱའོ།
en: Intrinsic nature” is knowledge and seeing because the thoroughly established state left over when the imaginary state of phenomena is eliminated is the intrinsic nature of knowledge and seeing. That is why it is so called.

source: །དེ་ལ་ཤེས་པའི་སྟོང་པ་ཉིད་གང་ཡིན་པ་དེ་ནི་ཤེས་པས་མ་བྱས་ལ། མཐོང་བའི་སྟོང་པ་ཉིད་གང་ཡིན་པ་དེ་ཡང་མཐོང་བས་མ་བྱས་ཏེ། དེ་ལྟ་བས་ན། ངོ་བོ་ཉིད་དེ་གཉིས་ཀྱི་སྟོང་པ་ཉིད་ནི་རང་བཞིན་ཡིན་པས་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཅེས་བྱའོ། །དེ་བཞིན་གཤེགས་པ་རྣམས་བྱུང་ཡང་རུང་།
en: There, the emptiness of knowledge “has not been made by knowledge,” and the emptiness of seeing “has not been made by seeing,” so, the emptiness of those two intrinsic natures is the “basic nature… called the emptiness of an intrinsic nature.” “

source: མ་བྱུང་རུང་སྟེ་ཞེས་བྱ་བ་ནི། གནས་པའི་མཚན་ཉིད་དེ་བཞིན་ཉིད་ཆོས་ཉིད་གང་ཡིན་པ་དེ། དེ་བཞིན་གཤེགས་པ་ལ་སོགས་པ་ཕ་རོལ་གཞན་གྱིས་བྱས་པ་མ་ཡིན་པའི་ཕྱིར། བྱེད་པ་པོ་གཞན་མེད་ལ། གཞན་གྱི་དངོས་པོ་སྟོང་པ་ཉིད་ཅེས་བྱའོ།
en: Whether the tathāgatas arise or whether the tathāgatas do not arise”— that “suchness,” that “true nature of dharmas” that marks what “remains,” is not made by something else—a “tathāgata” and so on that is other, so “the emptiness of a nature from something else” is said of what does not have a maker that is other.

source: །དེ་ནས་ཡང་ཏིང་ངེ་འཛིན་གྱི་ཐེག་པ་ཆེན་པོའི་གནས་སྐབས་དབྱེ་བའི་ཕྱིར།
en: 3. Great Vehicle of all the meditative stabilizations Then, in order to set the scene for the Great Vehicle of all the meditative stabilizations, it says “the meditative stabilization śūraṅgama” and so on.
